"""
Здесь все основные категории, подписи, шаблоны, периоды и прочие константы.
"""

# Ключи и русские названия категорий новостей
CATEGORY_LABELS = {
    "politics": "Политика",
    "society": "Общество",
    "economics": "Экономика",
    "tech": "Технологии",
    "military": "Армия",
    "sports": "Спорт",
    "science": "Наука",
    "culture": "Культура",
    "incident": "Происшествия",
    "other": "Другое"
}

# Список периодов, которые поддерживает бот (ключи)
PERIODS = ['day', 'week', 'month']

# Соответствие ключей и русских подписей периодов
PERIOD_LABELS = {
    'day':   'День',
    'week':  'Неделя',
    'month': 'Месяц'
}

